# Programming Lesson and Exercises - ORG<span class="tocSkip"></span>

The goal of these programming lesson and exercises is to teach you how to organise and query data in a relational database using Python and SQL.

<div class="alert-info alert" role="alert-info">Make sure to consult the lecture slides for more details on the relational database model and the SQL langauge.</div>


# Introduction to this template notebook

* This is a **personal** notebook.
* Make sure you work in a **copy** of `...-template.ipynb`, **renamed** to `...-yourIDnr.ipynb`, where `yourIDnr` is your TU/e identification number.

You are expected to work with Python code in this notebook. The locations where you should write your solutions can be recognized by **marker lines**, which look like this:

>`#//`
>    `BEGIN_TODO [Label]` `Description` `(n points)`
>
>`#//`
>    `END_TODO [Label]`

<div class="alert alert-warning" role="alert">
<ul>
    <li>Do NOT modify or delete these marker lines.  Keep them as they are.</li>
    <li>NEVER write code <i>outside</i> the marked blocks. Such code cannot be evaluated.</li>
</ul>
</div>

Proceed in this notebook as follows:
* **Read** the text.
* **Fill in** your solutions between `BEGIN_TODO` and `END_TODO` marker lines.
* **Run** _all_ code cells (also the ones _without_ your code),
    _in linear order_ from the first code cell.

<div class="alert alert-danger" role="danger">
<h3>Integrity</h3>
<ul>
    <li>In this course you must act according to the rules of the TU/e code of scientific conduct.</li>
    <li>All the exercises and the graded assignments are to be executed individually and independently.</li>
    <li>You must not copy from the Internet, your friends, books... If you represent other people's work as your own, then that constitutes fraud and will be reported to the Examination Committee.</li>
    <li>Making your work available to others (complicity) also constitutes fraud.</li>
</ul>
</div>

## Personalize your notebook

1. Copy the following three lines of code:

  ```python
  AUTHOR_NAME = 'Your Full Name'
  AUTHOR_ID_NR = '1234567'
  AUTHOR_DATE = 'YYYY-MM-DD'
  ```

1. Paste them between the marker lines in the next code cell.
1. Fill in your _full name, identification number,_ and the current _date_ (i.e. when you first modified this notebook, e.g. `'2020-02-26'`) as strings between quotes.
1. Run the code cell by putting the cursor there and typing **Control-Enter**.

In [1]:
#// BEGIN_TODO [Author] Name, Id.nr., Date, as strings (1 point)

AUTHOR_NAME = 'Thomas van der Bij'
AUTHOR_ID_NR = '1507486'
AUTHOR_DATE = '2020-02-03'

#// END_TODO [Author]

AUTHOR_NAME, AUTHOR_ID_NR, AUTHOR_DATE

('Thomas van der Bij', '1507486', '2020-02-03')

<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><ul class="toc-item"><li><span><a href="#Learning-objectives-of-this-lesson" data-toc-modified-id="Learning-objectives-of-this-lesson-0.1">Learning objectives of this lesson</a></span></li></ul></li><li><span><a href="#1.-SQL-Basics" data-toc-modified-id="1.-SQL-Basics-1"><span class="section">1.</span> SQL Basics</a></span><ul class="toc-item"><li><span><a href="#Introduction" data-toc-modified-id="Introduction-1.1">Introduction</a></span><ul class="toc-item"><li><span><a href="#Loading-the-libraries" data-toc-modified-id="Loading-the-libraries-1.1.1">Loading the libraries</a></span></li><li><span><a href="#Common-steps-in-working-with-SQLite-databases" data-toc-modified-id="Common-steps-in-working-with-SQLite-databases-1.1.2">Common steps in working with SQLite databases</a></span></li></ul></li><li><span><a href="#Step-1.-Connect-to-database" data-toc-modified-id="Step-1.-Connect-to-database-1.2">Step 1. Connect to database</a></span></li><li><span><a href="#Step-2.-Operate-on-database" data-toc-modified-id="Step-2.-Operate-on-database-1.3">Step 2. Operate on database</a></span><ul class="toc-item"><li><span><a href="#SELECT-statement" data-toc-modified-id="SELECT-statement-1.3.1"><code>SELECT</code> statement</a></span></li><li><span><a href="#WHERE-clause" data-toc-modified-id="WHERE-clause-1.3.2"><code>WHERE</code> clause</a></span></li><li><span><a href="#Exercise-1.a" data-toc-modified-id="Exercise-1.a-1.3.3">Exercise <span class="exercise">1.a</span></a></span></li><li><span><a href="#Exercise-1.b" data-toc-modified-id="Exercise-1.b-1.3.4">Exercise <span class="exercise">1.b</span></a></span></li><li><span><a href="#GROUP-BY-clause" data-toc-modified-id="GROUP-BY-clause-1.3.5"><code>GROUP BY</code> clause</a></span></li><li><span><a href="#Exercise-1.c" data-toc-modified-id="Exercise-1.c-1.3.6">Exercise <span class="exercise">1.c</span></a></span></li><li><span><a href="#ORDER-BY-clause" data-toc-modified-id="ORDER-BY-clause-1.3.7"><code>ORDER BY</code> clause</a></span></li><li><span><a href="#Exercise-1.d" data-toc-modified-id="Exercise-1.d-1.3.8">Exercise <span class="exercise">1.d</span></a></span></li><li><span><a href="#LIMIT-clause" data-toc-modified-id="LIMIT-clause-1.3.9"><code>LIMIT</code> clause</a></span></li><li><span><a href="#Exercise-1.e" data-toc-modified-id="Exercise-1.e-1.3.10">Exercise <span class="exercise">1.e</span></a></span></li><li><span><a href="#Joining-tables" data-toc-modified-id="Joining-tables-1.3.11">Joining tables</a></span></li><li><span><a href="#Exercise-1.f" data-toc-modified-id="Exercise-1.f-1.3.12">Exercise <span class="exercise">1.f</span></a></span></li><li><span><a href="#Subqueries,-or-nested-queries" data-toc-modified-id="Subqueries,-or-nested-queries-1.3.13">Subqueries, or nested queries</a></span></li><li><span><a href="#Exercise-1.g" data-toc-modified-id="Exercise-1.g-1.3.14">Exercise <span class="exercise">1.g</span></a></span></li></ul></li><li><span><a href="#Step-3.-Close-connection-to-database" data-toc-modified-id="Step-3.-Close-connection-to-database-1.4">Step 3. Close connection to database</a></span></li></ul></li><li><span><a href="#2.-Data-cleaning" data-toc-modified-id="2.-Data-cleaning-2"><span class="section">2.</span> Data cleaning</a></span><ul class="toc-item"><li><span><a href="#df.astype():-convert-to-given-type" data-toc-modified-id="df.astype():-convert-to-given-type-2.1"><code>df.astype()</code>: convert to given type</a></span><ul class="toc-item"><li><span><a href="#Exercise-2.a" data-toc-modified-id="Exercise-2.a-2.1.1">Exercise <span class="exercise">2.a</span></a></span></li></ul></li><li><span><a href="#pd.to_numeric():-convert-to-numeric" data-toc-modified-id="pd.to_numeric():-convert-to-numeric-2.2"><code>pd.to_numeric()</code>: convert to numeric</a></span></li><li><span><a href="#ts.unique():-find-all-unique-values" data-toc-modified-id="ts.unique():-find-all-unique-values-2.3"><code>ts.unique()</code>: find all unique values</a></span><ul class="toc-item"><li><span><a href="#Exercise-2.b" data-toc-modified-id="Exercise-2.b-2.3.1">Exercise <span class="exercise">2.b</span></a></span></li></ul></li><li><span><a href="#df.duplicated():-find-duplicates" data-toc-modified-id="df.duplicated():-find-duplicates-2.4"><code>df.duplicated()</code>: find duplicates</a></span><ul class="toc-item"><li><span><a href="#Exercise-2.c" data-toc-modified-id="Exercise-2.c-2.4.1">Exercise <span class="exercise">2.c</span></a></span></li></ul></li><li><span><a href="#df.drop_duplicates():-remove-duplicates" data-toc-modified-id="df.drop_duplicates():-remove-duplicates-2.5"><code>df.drop_duplicates()</code>: remove duplicates</a></span><ul class="toc-item"><li><span><a href="#Exercise-2.d" data-toc-modified-id="Exercise-2.d-2.5.1">Exercise <span class="exercise">2.d</span></a></span></li></ul></li><li><span><a href="#df.dropna()-to-remove-rows-with-missing-values" data-toc-modified-id="df.dropna()-to-remove-rows-with-missing-values-2.6"><code>df.dropna()</code> to remove rows with missing values</a></span><ul class="toc-item"><li><span><a href="#Exercise-2.e" data-toc-modified-id="Exercise-2.e-2.6.1">Exercise <span class="exercise">2.e</span></a></span></li></ul></li><li><span><a href="#df.fillna()-to-replace-missing-values" data-toc-modified-id="df.fillna()-to-replace-missing-values-2.7"><code>df.fillna()</code> to replace missing values</a></span><ul class="toc-item"><li><span><a href="#Exercise-2.f" data-toc-modified-id="Exercise-2.f-2.7.1">Exercise <span class="exercise">2.f</span></a></span></li></ul></li><li><span><a href="#ts.str.strip()-to-strip-characters-from-begin/end-of-strings" data-toc-modified-id="ts.str.strip()-to-strip-characters-from-begin/end-of-strings-2.8"><code>ts.str.strip()</code> to strip characters from begin/end of strings</a></span><ul class="toc-item"><li><span><a href="#Exercise-2.g" data-toc-modified-id="Exercise-2.g-2.8.1">Exercise <span class="exercise">2.g</span></a></span></li></ul></li></ul></li><li><span><a href="#3.-Exercises:-cleaning-the-mouse-experiment" data-toc-modified-id="3.-Exercises:-cleaning-the-mouse-experiment-3"><span class="section">3.</span> Exercises: cleaning the mouse experiment</a></span><ul class="toc-item"><li><ul class="toc-item"><li><span><a href="#Exercise-3.a" data-toc-modified-id="Exercise-3.a-3.0.1">Exercise <span class="exercise">3.a</span></a></span></li><li><span><a href="#Exercise-3.b" data-toc-modified-id="Exercise-3.b-3.0.2">Exercise <span class="exercise">3.b</span></a></span></li><li><span><a href="#Exercise-3.c" data-toc-modified-id="Exercise-3.c-3.0.3">Exercise <span class="exercise">3.c</span></a></span></li><li><span><a href="#Exercise-3.d" data-toc-modified-id="Exercise-3.d-3.0.4">Exercise <span class="exercise">3.d</span></a></span></li><li><span><a href="#Exercise-3.e" data-toc-modified-id="Exercise-3.e-3.0.5">Exercise <span class="exercise">3.e</span></a></span></li><li><span><a href="#Exercise-3.f" data-toc-modified-id="Exercise-3.f-3.0.6">Exercise <span class="exercise">3.f</span></a></span></li><li><span><a href="#Exercise-3.g" data-toc-modified-id="Exercise-3.g-3.0.7">Exercise <span class="exercise">3.g</span></a></span></li></ul></li></ul></li><li><span><a href="#4.-Exercises:-analyzing-the-mouse-experiment" data-toc-modified-id="4.-Exercises:-analyzing-the-mouse-experiment-4"><span class="section">4.</span> Exercises: analyzing the mouse experiment</a></span><ul class="toc-item"><li><ul class="toc-item"><li><span><a href="#Exercise-4.a" data-toc-modified-id="Exercise-4.a-4.0.1">Exercise <span class="exercise">4.a</span></a></span></li><li><span><a href="#Exercise-4.b" data-toc-modified-id="Exercise-4.b-4.0.2">Exercise <span class="exercise">4.b</span></a></span></li><li><span><a href="#Exercise-4.c" data-toc-modified-id="Exercise-4.c-4.0.3">Exercise <span class="exercise">4.c</span></a></span></li><li><span><a href="#Exercise-4.d" data-toc-modified-id="Exercise-4.d-4.0.4">Exercise <span class="exercise">4.d</span></a></span></li><li><span><a href="#Exercise-4.e" data-toc-modified-id="Exercise-4.e-4.0.5">Exercise <span class="exercise">4.e</span></a></span></li><li><span><a href="#Exercise-4.f" data-toc-modified-id="Exercise-4.f-4.0.6">Exercise <span class="exercise">4.f</span></a></span></li><li><span><a href="#Exercise-4.g" data-toc-modified-id="Exercise-4.g-4.0.7">Exercise <span class="exercise">4.g</span></a></span></li><li><span><a href="#Exercise-4.h" data-toc-modified-id="Exercise-4.h-4.0.8">Exercise <span class="exercise">4.h</span></a></span></li></ul></li></ul></li><li><span><a href="#(End-of-Notebook)" data-toc-modified-id="(End-of-Notebook)-5">(End of Notebook)</a></span></li></ul></div>

## Learning objectives of this lesson

After this lesson, you should

* know how to work with SQLite databases through Pandas data frames;
* know how to query data in a SQLite database using Python and its `sqlite3` library.
* know how to perform basic data cleaning tasks using Pandas

# <span class="section">1.</span> SQL Basics

## Introduction

So far, we have dealt with data given as a _single table_,
typically stored in a CSV file and operated on in a Pandas `DataFrame`.
Often, however, the use of a single table leads to unnecessary duplication of data
and difficulties in data processing.

For example,
consider an experiment where we collect data from various patients.
We have data pertaining to each patient:
name, date of birth, and daily weight and temperature measurements.
How to _organize_ that data and store it?
This is important for the _data collection_ process and subsequent
_data analysis_ process.

You could try to put it in one table,
with one row per patient, and columns for name, date of birth, and every day:

| Name | Date of Birth | Day 1 Weight | Day 1 Temperature | Day 2 Weight | Day 2 Temperature | ... |
| :--- | :------------ | -----------: | ----------------: | -----------: | ----------------: | --: |
| A | 1950-01-01 | 60.0 | 37.8 | 59.8 | 38.1 | ... |
| B | 1947-07-15 | 84.3 | 39.2 | 85.0 | 38.5 | ... |
| ... | ... | ... | ... | ... | ... | ... |

The number of columns would grow, and could differ per patient.

You could try to put it in one table,
with one row per patient per day,
and columns for name, date of birth, day, weight, and temperature,
repeating values that stay the same (name and date of birth):

| Name | Date of Birth | Day | Weight | Temperature |
| :--- | :------------ | --: | -----: | ----------: |
| A | 1950-01-01 | 1 | 60.0 | 37.8 |
| B | 1947-07-15 | 1 | 84.3 | 39.2 |
| A | 1950-01-01 | 2 | 59.8 | 38.1 |
| B | 1947-07-15 | 2 | 84.3 | 39.2 |
| ... | ... | ... | ... | ... |

In this approach, some data (necessarily) gets duplicated.

Also, note that patients may not be uniquely identified by name and date of birth.
In the first table, their measurements would still be kept apart.
But in the second table, this starts to be problematic.

Using multiple, related tables is a better approach.
In this case, two tables could be used:

**Patient data**

| ID | Name | Date of Birth |
| -: | :--- | :------------ |
| 13 | A | 1950-01-01 |
| 72 | B | 1947-07-15 |
| ... | ... | ... |

**Measurement data**

| ID | Day | Weight | Temperature |
| -: | --: | -----: | ----------: |
| 13 |  1 | 60.0 | 37.8 |
| 72 |  1 | 84.3 | 39.2 |
| 13 |  2 | 59.8 | 38.1 |
| 72 |  2 | 84.3 | 39.2 |
| ... | ... | ... | ... |

The additional column `ID` relates the two tables,
and helps to keep apart patients with the same name and date of birth.

We assume that you have a basic understanding of how a _relational database_ is organized:

* a collection of (named, related) *tables*, where
* each table consists of a collection of *rows*, where
* each row contains one _value_ per *column*,
* where all values in a column belong to a prescribed *type*.

In this lesson we will use **SQL**, which stands for **Structured Query Language**,
a standardized language to work with _relational databases_.

We will use **SQLite** as _SQL database engine_
(it knows SQL, though not all of it).
Note that SQLite is a separate piece of open-source software,
that is installed as part of Anaconda.

### Loading the libraries

To show examples, we load some Data Analytics libraries first:

In [2]:
import numpy as np
import pandas as pd

Next, we load **`sqlite3`**, a Python library to work with _SQLite_ databases:

In [3]:
import sqlite3

### Common steps in working with SQLite databases

Typically, the following sequence of steps takes place, when working with an SQL database.

1. Connect to the database (residing in a file).
2. Operate on the database:

    * execute queries, to retrieve selected values;
    * create, update, or delete rows/values in a table;
    * create, alter (by adding or deleting columns), or delete tables.
    
3. Close the connection to the database.

Step 2 can be repeated as desired.

## Step 1. Connect to database

In order to work with a database, a _connection_ to that database needs to be established.

In these exercises we will work with the SQLite database engine. An SQLite database is stored in a (binary) file in the file system. You connect to it via

* **`sqlite3.connect(file_name)`**

This function returns a **connection object**, that will be used in subsequent operations.

Here we open a connection to the database stored in the file `'countries.db'` and assign it to a variable named `conn_countries`:

In [4]:
conn_countries = sqlite3.connect('datasets/countries.db')

> **Note:** If the database file does not exist, it will be created, starting out with an empty database.

The `'countries.db'` database contains two tables: `'continents'` and `'countries'`. The `'continents'` table has following columns:

- `'code'`: A two letter code of the continent.
- `'name'`: The name of the continent.

The `'countries'` has the following columns:

- `'name'`: The name of the country.
- `'alpha_3'`: The ISO 3166-1 alpha-3 code of the country.
- `'tld'`: The top-level domain of the country.
- `'continent'`: A two letter code of the continent where the country is located (corresponding to the codes in the `'continents'` table).
- `'capital'`: The name of the capital of the country.
- `'area'`: The area of the country (in square km).
- `'population'`: The population size of the country.

## Step 2. Operate on database

When working with an SQL database, operations are expressed as **SQL statements**. SQL defines many statements for organising and manipulating data in a database. In these exercises we will focus on querying data using the **SELECT** statement. See [W3 Schools - SQL Tutorial](https://www.w3schools.com/sql/) for more details about SQL.

General rules:

* SQL is _not_ case sensitive (`SELECT` and `select` are treated the same way).
* SQL statements are always terminated by a semicolon ('**`;`**').
* SQL identifiers that contain spaces, or that are the same as a keyword, are enclosed in **double quotes**.
* SQL string literals are enclosed in **single quotes**.

### `SELECT` statement

The SQL **SELECT** statement retrieves values from a database and presents the result as a table organized in rows and columns.

The SELECT statement has a number of required and optional clauses:

| Clause | Type | Remarks |
| :----- | :--: | :------ |
| `SELECT` _`expr1, expr2, ...`_ | Required | `SELECT *` selects all columns; `SELECT DISTINCT ...` |
| `FROM` _`table1, table2, ...`_ | Required | |
| `WHERE` _`condition`_ | Optional | Filter on boolean condition before grouping |
| `GROUP BY` _`column1, column2, ...`_ | Optional | |
| `ORDER BY` _`column1, column2, ...`_ | Optional | Append `DESC` for descending order |
| `LIMIT` _`number`_ | Optional | Report only first given number of rows |

Numeric expressions _`expr1`_ etc. can contain

* _column names_; must be disambiguated by prepending _table name_: `table1.column1`
* aliases for renaming column/table names: e.g. `table1.column1 AS 'some name'` to rename `table1.column1` to `'some name'` (aliases exist only for the duration of the query)
* operators: +, -, *, /, %
* functions: MIN, MAX, COUNT, SUM, AVG (these aggregate when `GROUP BY` is used)

A SQL query is stored in a Python string. Here is an example of a query that returns all the data in the `'countries'` table.

In [5]:
query_all = 'SELECT * FROM countries;'

The Pandas library offers a convenient function to work with SQL databases:

* **`pd.read_sql_query(query, connection)`** : execute an SQL `query` on an open `connection` to an SQL database, and return the query result as a `DataFrame`.

Here is an example of executing the above query `query_all` on the previously opened connection `conn_countries`:

In [6]:
pd.read_sql_query(query_all, conn_countries)

,name,alpha_3,tld,continent,capital,area,population
0,Andorra,AND,.ad,EU,Andorra la Vella,468.00,84000
1,United Arab Emirates,ARE,.ae,AS,Abu Dhabi,82880.00,4975593
2,Afghanistan,AFG,.af,AS,Kabul,647500.00,29121286
3,Antigua and Barbuda,ATG,.ag,NM,St. John's,443.00,86754
4,Anguilla,AIA,.ai,NM,The Valley,102.00,13254
5,Albania,ALB,.al,EU,Tirana,28748.00,2986952
6,Armenia,ARM,.am,AS,Yerevan,29800.00,2968000
7,Angola,AGO,.ao,AF,Luanda,1246700.00,13068161
8,Antarctica,ATA,.aq,AN,None,14000000.00,0
9,Argentina,ARG,.ar,SM,Buenos Aires,2766890.00,41343201
10,American Samoa,ASM,.as,OC,Pago Pago,199.00,57881
11,Austria,AUT,.at,EU,Vienna,83858.00,8205000
12,Australia,AUS,.au,OC,Canberra,7686850.00,21515754
13,Aruba,ABW,.aw,NM,Oranjestad,193.00,71566
14,Aland Islands,ALA,.ax,EU,Mariehamn,1580.00,26711
15,Azerbaijan,AZE,.az,AS,Baku,86600.00,8303512
16,Bosnia and Herzegovina,BIH,.ba,EU,Sarajevo,51129.00,4590000
17,Barbados,BRB,.bb,NM,Bridgetown,431.00,285653
18,Bangladesh,BGD,.bd,AS,Dhaka,144000.00,156118464
19,Belgium,BEL,.be,EU,Brussels,30510.00,10403000
20,Burkina Faso,BFA,.bf,AF,Ouagadougou,274200.00,16241811
21,Bulgaria,BGR,.bg,EU,Sofia,110910.00,7148785
22,Bahrain,BHR,.bh,AS,Manama,665.00,738004
23,Burundi,BDI,.bi,AF,Bujumbura,27830.00,9863117
24,Benin,BEN,.bj,AF,Porto-Novo,112620.00,9056010
25,Saint Barthelemy,BLM,.gp,NM,Gustavia,21.00,8450
26,Bermuda,BMU,.bm,NM,Hamilton,53.00,65365
27,Brunei,BRN,.bn,AS,Bandar Seri Begawan,5770.00,395027
28,Bolivia,BOL,.bo,SM,Sucre,1098580.00,9947418
29,"Bonaire, Saint Eustatius and Saba",BES,.bq,NM,None,328.00,18012
...,...,...,...,...,...,...,...
221,East Timor,TLS,.tl,OC,Dili,15007.00,1154625
222,Turkmenistan,TKM,.tm,AS,Ashgabat,488100.00,4940916
223,Tunisia,TUN,.tn,AF,Tunis,163610.00,10589025
224,Tonga,TON,.to,OC,Nuku'alofa,748.00,122580
225,Turkey,TUR,.tr,AS,Ankara,780580.00,77804122
226,Trinidad and Tobago,TTO,.tt,NM,Port of Spain,5128.00,1228691
227,Tuvalu,TUV,.tv,OC,Funafuti,26.00,10472
228,Taiwan,TWN,.tw,AS,Taipei,35980.00,22894384
229,Tanzania,TZA,.tz,AF,Dodoma,945087.00,41892895
230,Ukraine,UKR,.ua,EU,Kiev,603700.00,45415596
231,Uganda,UGA,.ug,AF,Kampala,236040.00,33398682
232,United States Minor Outlying Islands,UMI,.um,OC,None,0.00,0
233,United States,USA,.us,NM,Washington,9629091.00,310232863
234,Uruguay,URY,.uy,SM,Montevideo,176220.00,3477000
235,Uzbekistan,UZB,.uz,AS,Tashkent,447400.00,27865738
236,Vatican,VAT,.va,EU,Vatican City,0.44,921
237,Saint Vincent and the Grenadines,VCT,.vc,NM,Kingstown,389.00,104217
238,Venezuela,VEN,.ve,SM,Caracas,912050.00,27223228
239,British Virgin Islands,VGB,.vg,NM,Road Town,153.00,21730
240,U.S. Virgin Islands,VIR,.vi,NM,Charlotte Amalie,352.00,108708
241,Vietnam,VNM,.vn,AS,Hanoi,329560.00,89571130
242,Vanuatu,VUT,.vu,OC,Port Vila,12200.00,221552
243,Wallis and Futuna,WLF,.wf,OC,Mata Utu,274.00,16025
244,Samoa,WSM,.ws,OC,Apia,2944.00,192001
245,Yemen,YEM,.ye,AS,Sanaa,527970.00,23495361
246,Mayotte,MYT,.yt,AF,Mamoudzou,374.00,159042
247,South Africa,ZAF,.za,AF,Pretoria,1219912.00,49000000
248,Zambia,ZMB,.zm,AF,Lusaka,752614.00,13460305
249,Zimbabwe,ZWE,.zw,AF,Harare,390580.00,13061000
250,Netherlands Antilles,ANT,.an,NM,Willemstad,960.00,300000

### `WHERE` clause

The `WHERE` clause is a boolean condition, which can contain:

* _column names_
* comparison operators: =, <>, <, >, <=, >=
* boolean operators: NOT, AND, OR
* pattern matching operator (to match string values against a pattern with wildcards): LIKE
    * e.g. condition `... WHERE name LIKE "Nether%"` will select rows containing a string starting with `Nether` in the `name` column

Here is an example of a query that selects all rows from the table `countries`, that have an area less than 1000 and a population over 200000, showing the columns `'name'` and `'capital'`:

In [7]:
query_area_population = '''
    SELECT name, capital
    FROM countries
    WHERE area < 1000 AND population > 200000;
'''
pd.read_sql_query(query_area_population, conn_countries)

                   name     capital
0              Barbados  Bridgetown
1               Bahrain      Manama
2                 Macao       Macao
3                 Malta    Valletta
4              Maldives        Male
5             Singapore   Singapore
6  Netherlands Antilles  Willemstad

### Exercise <span class="exercise">1.a</span>

Execute the following query to select the name and area of all countries with an area larger than one million square km:

```
SELECT name, area
FROM countries
WHERE area > 1000000
```

Execute the query on the open database connection `conn_countries`. Assign the resulting data frame to variable `result_select`.

In [19]:
#// BEGIN_TODO [ORG_1a] Execute pre-defined query (1 point)

result_select_0 = '''
    SELECT name, capital
    FROM countries
    WHERE area > 1000000
'''
result_select = pd.read_sql_query(result_select_0, conn_countries)

#// END_TODO [ORG_1a]

result_select

                                name       capital
0                             Angola        Luanda
1                         Antarctica          None
2                          Argentina  Buenos Aires
3                          Australia      Canberra
4                            Bolivia         Sucre
5                             Brazil      Brasilia
6                             Canada        Ottawa
7   Democratic Republic of the Congo      Kinshasa
8                              China       Beijing
9                           Colombia        Bogota
10                           Algeria       Algiers
11                             Egypt         Cairo
12                          Ethiopia   Addis Ababa
13                         Greenland          Nuuk
14                         Indonesia       Jakarta
15                             India     New Delhi
16                              Iran        Tehran
17                        Kazakhstan        Astana
18                             Libya       Tripoli
19                              Mali        Bamako
20                          Mongolia    Ulan Bator
21                        Mauritania    Nouakchott
22                            Mexico   Mexico City
23                             Niger        Niamey
24                              Peru          Lima
25                            Russia        Moscow
26                      Saudi Arabia        Riyadh
27                             Sudan      Khartoum
28                              Chad     N'Djamena
29                     United States    Washington
30                      South Africa      Pretoria

### Exercise <span class="exercise">1.b</span>

Execute a query to select the name and population of European countries with a population larger than 60 million. Assign the query to variable `query_where` and the result to variable `result_where`.

In [29]:
#// BEGIN_TODO [ORG_1b] Define and execute a query (1 point)

result_select_0 = '''
    SELECT name, population
    FROM countries
    WHERE population > 60000000 AND  continent = 'EU';
'''
result_where = pd.read_sql_query(result_select_0, conn_countries)

#// END_TODO [ORG_1b]

result_where

             name  population
0         Germany    81802257
1          France    64768389
2  United Kingdom    62348447
3           Italy    60340328
4          Russia   140702000

### `GROUP BY` clause

The `GROUP BY` clause aggregates data, similarly to the `.groupby()` method in Pandas. The `MIN`, `MAX`, `COUNT`, `SUM`, `AVG` functions are used in the `SELECT` expression to specify how to aggregate the data in the columns.

Here is an example query using the `GROUP BY` clause to obtain an overview of all continents, with for each continent:

* the continent code
* the number of countries on it
* the total population
* the maximum population over its countries

In [30]:
query = '''
    SELECT continent, COUNT(name), SUM(population), MAX(population)
    FROM countries
    GROUP BY continent
'''
pd.read_sql_query(query, conn_countries)

  continent  COUNT(name)  SUM(population)  MAX(population)
0        AF           58       1016879730        154000000
1        AN            5              170              140
2        AS           52       4130586341       1330044000
3        EU           53        739141025        140702000
4        NM           42        540105043        310232863
5        OC           27         36066049         21515754
6        SM           14        400143568        201103330

### Exercise <span class="exercise">1.c</span>

Execute a query to obtain an overview of the continents, showing for each continent the continent code and the total area. Assign the query to variable `query_group` and the result to variable `result_group`.

In [32]:
#// BEGIN_TODO [ORG_1c] Define and execute a query (1 point)

query_group = '''
    SELECT continent, SUM(area)
    FROM countries
    GROUP BY continent
'''
result_group = pd.read_sql_query(query_group, conn_countries)

#// END_TODO [ORG_1c]

result_group

  continent    SUM(area)
0        AF  30360296.00
1        AN  14012193.00
2        AS  31603228.70
3        EU  23079944.09
4        NM  24512514.00
5        OC   8523505.90
6        SM  17818508.00

### `ORDER BY` clause

The `ORDER BY` clause orders the resulting rows in either ascending (`ASC`) or descending (`DESC`) order. The `ASC` or `DESC` argument can be skipped, in which case the default is ascending order.

Here is an example query using the `ORDER BY` clause to obtain an overview of countries sorted in descending order on population size:

In [33]:
query = '''
    SELECT name, population
    FROM countries
    ORDER BY population DESC;
'''
pd.read_sql_query(query, conn_countries)

                                             name  population
0                                           China  1330044000
1                                           India  1173108018
2                                   United States   310232863
3                                       Indonesia   242968342
4                                          Brazil   201103330
5                                        Pakistan   184404791
6                                      Bangladesh   156118464
7                                         Nigeria   154000000
8                                          Russia   140702000
9                                           Japan   127288000
10                                         Mexico   112468855
11                                    Philippines    99900177
12                                        Vietnam    89571130
13                                       Ethiopia    88013491
14                                        Germany    81802257
15                                          Egypt    80471869
16                                         Turkey    77804122
17                                           Iran    76923300
18               Democratic Republic of the Congo    70916439
19                                       Thailand    67089500
20                                         France    64768389
21                                 United Kingdom    62348447
22                                          Italy    60340328
23                                        Myanmar    53414374
24                                   South Africa    49000000
25                                    South Korea    48422644
26                                       Colombia    47790000
27                                          Spain    46505963
28                                        Ukraine    45415596
29                                       Tanzania    41892895
..                                            ...         ...
221                                 Aland Islands       26711
222                        British Virgin Islands       21730
223                                  Cook Islands       21388
224                      Turks and Caicos Islands       20556
225                                         Palau       19907
226            Bonaire, Saint Eustatius and Saba        18012
227                             Wallis and Futuna       16025
228                                      Anguilla       13254
229                                        Tuvalu       10472
230                                         Nauru       10065
231                                    Montserrat        9341
232                              Saint Barthelemy        8450
233                                  Saint Helena        7460
234                     Saint Pierre and Miquelon        7012
235                British Indian Ocean Territory        4000
236                              Falkland Islands        2638
237                        Svalbard and Jan Mayen        2550
238                                          Niue        2166
239                                Norfolk Island        1828
240                              Christmas Island        1500
241                                       Tokelau        1466
242                                       Vatican         921
243                                 Cocos Islands         628
244                   French Southern Territories         140
245                                      Pitcairn          46
246  South Georgia and the South Sandwich Islands          30
247                                    Antarctica           0
248                                 Bouvet Island           0
249             Heard Island and McDonald Islands           0
250          United States Minor Outlying Islands           0

[251 rows x 2 columns]

### Exercise <span class="exercise">1.d</span>

Execute a query to select the name, continent code, population, and area of all
countries with an area larger than one million square km and the population is less than ten million, ordered in ascending order on area. Assign the query to variable `query_order` and the result to variable `result_order`.

In [38]:
#// BEGIN_TODO [ORG_1d] Define and execute a query (1 point)

query_order = '''
    SELECT name, continent, population, area
    FROM countries
    WHERE area > 1000000 AND population < 10000000
    ORDER BY area ASC;
'''
result_order = pd.read_sql_query(query_order, conn_countries)

#// END_TODO [ORG_1d]

result_order

         name continent  population        area
0  Mauritania        AF     3205060   1030700.0
1     Bolivia        SM     9947418   1098580.0
2    Mongolia        AS     3086918   1565000.0
3       Libya        AF     6461454   1759540.0
4   Greenland        NM       56375   2166086.0
5  Antarctica        AN           0  14000000.0

### `LIMIT` clause

The `LIMIT n` clause limits the result to only the first `n` rows. Here is an example query using the `LIMIT` clause to obtain an overview of top 10 countries sorted in descending order on population size:

In [36]:
query = '''
    SELECT name, population
    FROM countries
    ORDER BY population DESC
    LIMIT 10;
'''
pd.read_sql_query(query, conn_countries)

            name  population
0          China  1330044000
1          India  1173108018
2  United States   310232863
3      Indonesia   242968342
4         Brazil   201103330
5       Pakistan   184404791
6     Bangladesh   156118464
7        Nigeria   154000000
8         Russia   140702000
9          Japan   127288000

### Exercise <span class="exercise">1.e</span>

Execute a query to select the name and area of the three countries with the largest area that is smaller than one million square km, ordered in descending order on area. Assign the query to variable `query_limit` and the result to variable `result_limit`.

In [42]:
#// BEGIN_TODO [ORG_1e] Define and execute a query (1 point)

query_limit = '''
    SELECT name, area
    FROM countries
    WHERE area < 1000000
    ORDER BY area DESC
    LIMIT 3;
'''
result_limit = pd.read_sql_query(query_limit, conn_countries)

#// END_TODO [ORG_1e]

result_limit

        name      area
0   Tanzania  945087.0
1    Nigeria  923768.0
2  Venezuela  912050.0

### Joining tables

A benefit of a relational database is that data from different tables can be related together. For example, when selecting countries from the `'countries'` table we may like to return the full name of their continent, instead of the continent code. We can achieve this by joining the data from the `'countries'` and `'continents'` columns. First, let's see what the `'continents'` table contains:

In [43]:
pd.read_sql_query('SELECT * FROM continents;', conn_countries)

  code           name
0   AF         Africa
1   AN     Antarctica
2   AS           Asia
3   EU         Europe
4   NM  North America
5   OC        Oceania
6   SM  South America

Note that the column `'continent'` in `countries` uses the exact same encoding for continents as the column '`code`' of `continents`. It serves as the **primary key** in `continents`.

Now, let's **join** data from the two tables `countries` and `continents` in such a way, that each row of top 10 countries in Europe sorted in descending order on population size will also show the full name of the continent for that country:

In [44]:
query = '''
    SELECT countries.name, population, continents.name AS 'continent name'
    FROM countries, continents
    WHERE countries.continent = continents.code
    ORDER BY population DESC
    LIMIT 10;
'''
pd.read_sql_query(query, conn_countries)

            name  population continent name
0          China  1330044000           Asia
1          India  1173108018           Asia
2  United States   310232863  North America
3      Indonesia   242968342           Asia
4         Brazil   201103330  South America
5       Pakistan   184404791           Asia
6     Bangladesh   156118464           Asia
7        Nigeria   154000000         Africa
8         Russia   140702000         Europe
9          Japan   127288000           Asia

> **NOTES**
> * The column name `name` appears in both tables `countries` and `continents`. Therefore, we need to prefix it with the table name to disambiguate it.
> * In the result, we want the column with continent names to be labeled '`'continent name'`'. Therefore, we use the _alias_ `AS 'continent name'`.

### Exercise <span class="exercise">1.f</span>

Execute a query to compute the total population per continent. The result should contain two columns: `'continent name'` (containing full names of the continents) and `'total population'`.

Assign the query to variable `query_join` and the result to variable `result_join`.

In [49]:
#// BEGIN_TODO [ORG_1f] Population per continent (1 point)

query_join = '''
    SELECT  continents.name AS 'continent name' , SUM(population) AS "total population"
    FROM countries, continents
    WHERE countries.continent = continents.code
    GROUP BY continent
'''
result_join = pd.read_sql_query(query_join, conn_countries)

#// END_TODO [ORG_1f]

result_join

  continent name  total population
0         Africa        1016879730
1     Antarctica               170
2           Asia        4130586341
3         Europe         739141025
4  North America         540105043
5        Oceania          36066049
6  South America         400143568

### Subqueries, or nested queries

The result of one `SELECT` query can be combined with another `SELECT` query.

For instance, `SELECT` queries can be combined by 

* **`UNION`** to obtain the union of the `SELECT` query results
* **`INTERSECT`** to obtain the intersection of the `SELECT` query results
* **`EXCEPT`** to obtain the rows in the first result without those occurring the second result

These correspond to the **union**, **intersection** and **relative complement** operations on sets. See the lecture slides and <a href="https://en.wikipedia.org/wiki/Set_(mathematics)#Basic_operations">Set Â§ Basic operations</a> for more details.

In some cases, the same result can be obtained by using **`AND`**, **`OR`**, and **`AND NOT`**
in the `WHERE` clause.

We give one example for `EXCEPT` that cannot simply be expressed using `AND NOT`.

* First, we define and execute a query to select continents
    that have countries whose name starts with an 'E'.
    
> We use the `LIKE` operator in the `WHERE` clause with the wild card `%`, which matches zero, one, or multiple characters. For example, `name LIKE 'E%'` matches countries with a name that starts with an `'E'` and is followed by zero, one, or multiple characters.

* Second, we define and execute a query to select continents
    that have countries whose area exceeds ten million square km.
* Third, we define and execute a query to select continents
    that have countries whose name starts with an 'E'
    but that do _not_ have countries whose area exceeds ten million square km.

In [50]:
query_E = '''
    SELECT continent
    FROM countries
    WHERE name LIKE 'E%'
'''
pd.read_sql_query(query_E, conn_countries)

  continent
0        SM
1        EU
2        AF
3        AF
4        AF
5        AF
6        NM
7        OC

In [51]:
query_large = '''
    SELECT continent
    FROM countries
    WHERE area > 10000000
'''
pd.read_sql_query(query_large, conn_countries)

  continent
0        AN
1        EU

In [52]:
query_E_except_large = query_E + '''
    EXCEPT
''' + query_large
print(query_E_except_large)
pd.read_sql_query(query_E_except_large, conn_countries)

    SELECT continent
    FROM countries
    WHERE name LIKE 'E%'

    EXCEPT

    SELECT continent
    FROM countries
    WHERE area > 10000000

  continent
0        AF
1        NM
2        OC
3        SM

### Exercise <span class="exercise">1.g</span>

Execute a query to select those continents that

* have countries whose name ends in 'd', and
* do _not_ have countries whose population exceeds one hundred million.

Assign the query to variable `query_nested` and the result to variable `result_nested`.

In [55]:
#// BEGIN_TODO [ORG_1g] Find the continents (1 point)

query_nested = '''
    SELECT continent
    FROM countries
    WHERE name LIKE '%d'
    EXCEPT
    SELECT continent
    FROM countries
    WHERE population > 10000000
'''


result_nested = pd.read_sql_query(query_nested, conn_countries)

#// END_TODO [ORG_1g]

result_nested

  continent
0        AN

## Step 3. Close connection to database

Once you no longer want to work with the database, you can (and are encouraged to) close the connection to it:

In [ ]:
conn_countries.close()

# <span class="section">2.</span> Data cleaning

**Raw data** is often not in a form where it can easily be processed.
There can be all kinds of smaller or bigger issues with data.

* extra spaces at the begin and/or end of a string
* missing values
* duplicates
* inconsistencies

The process of preparing data for further processing is called **data cleaning**. In this section, we deal with a few common issues.

The following Pandas functions for data frames and series are relevant.

Let `df` be a `DataFrame` and `ts` be a `Series` object.
Note that `pd` stands for the Pandas library itself.

For the examples, we use the data in the `'datasets/countries.csv'` file.

In [ ]:
country_data = pd.read_csv('datasets/countries.csv', na_values=[''], keep_default_na=False)
country_data.head()

## `df.astype()`: convert to given type

With **`df.astype()`** you convert it to a given type.
The `.dtypes` attribute of a data frame contains the column types:

In [ ]:
country_data.dtypes

We can see that columns `'name'`, ... , `'capital'` are of type `object` (which is also used for columns containing strings), `'area'` contains floating point numbers and `'population'` contains integers. We can convert all columns in a data frame to strings:

In [ ]:
country_data_as_str = country_data.astype(str)
country_data_as_str.dtypes

We can also convert the type of particular columns by supplying a dictionary as argument to `astype()`:

In [ ]:
population_as_str = country_data.astype({'population': str})
population_as_str.dtypes

### Exercise <span class="exercise">2.a</span>

Change the type of the area to `int` and assign the resulting data frame to `area_as_int`.

In [ ]:
#// BEGIN_TODO [ORG_2a] Area as int (1 point)

# ===== =====> Replace this line by your code. <===== ===== #

#// END_TODO [ORG_2a]

area_as_int.dtypes

##  `pd.to_numeric()`: convert to numeric

With **`pd.to_numeric()`** you can convert an argument to a numeric type. A suitable numeric type (e.g. `int` or `float`) will be chosen.
The argument can be a _list_ or _Series_.

In [ ]:
pd.to_numeric(country_data_as_str['population']).head()

In [ ]:
pd.to_numeric(country_data_as_str['area']).head()

## `ts.unique()`: find all unique values

With `ts.unique()` you obtain an array in which each item of the series appears once.
The order in the array is in the order of appearance in the series object.

In [ ]:
country_data['capital'].unique()

### Exercise <span class="exercise">2.b</span>

Find all unique continent names in the `country_data` data frame and assign the result to `unique_continents`.

In [ ]:
#// BEGIN_TODO [ORG_2b] Unique continents (1 point)

# ===== =====> Replace this line by your code. <===== ===== #

#// END_TODO [ORG_2b]

unique_continents

## `df.duplicated()`: find duplicates

With **`df.duplicated()`** you obtain a _boolean mask_
indicating which rows appear more than once.
With the argument **`subset=`** you can restrict the search for duplicates
to specific columns
(either a single column or a list of columns).

In [ ]:
bm_dup_capital = country_data.duplicated(subset='capital')
country_data[bm_dup_capital]

There is an extra argument `keep`:

* **`keep='first'`** (default): Mark duplicates as `True` _except for the first occurrence_.
* **`keep='last'`** : Mark duplicates as `True` _except for the last occurrence_.
* **`keep=False`**`: Mark all duplicates as `True`.

In [ ]:
bm_dup_capital_all = country_data.duplicated(subset='capital', keep=False)
country_data[bm_dup_capital_all]

### Exercise <span class="exercise">2.c</span>

Some countries in `country_data` share the same `'tld'`. Find the list of `'tld'`s that are shared by more than one country and assign it to `duplicate_tld`.

In [ ]:
#// BEGIN_TODO [ORG_2c] Duplicated data (1 point)

# ===== =====> Replace this line by your code. <===== ===== #

#// END_TODO [ORG_2c]

duplicate_tld

## `df.drop_duplicates()`: remove duplicates

With **`df.drop_duplicates()`** you can remove duplicated rows.
With the argument **`subset=`** you can restrict the search for duplicates to specific columns.

In [ ]:
country_data.info()

In [ ]:
country_data.drop_duplicates(subset=['capital']).info()

There is an extra argument `keep`:

* **`keep='first'`** (default): Drop duplicates _except for the first occurrence_.
* **`keep='last'`** : Drop duplicates _except for the last occurrence_.
* **`keep=False`**: Drop all duplicates.

### Exercise <span class="exercise">2.d</span>

Drop from the `country_data` data frame all countries which share the same tld and continent with another country. Assign the resulting data frame to `dropped_dup_tld`.

In [ ]:
#// BEGIN_TODO [ORG_2d] Drop duplicated data (1 point)

# ===== =====> Replace this line by your code. <===== ===== #

#// END_TODO [ORG_2d]

dropped_dup_tld.info()

## `df.dropna()` to remove rows with missing values

In the EDA programming exercises the `.isnull()` method was introduced to show rows with missing values (_Not-Available_ (NA) and _Not-a-Number_ (NaN)). With **`df.dropna()`** you can remove rows with *missing values* in a data frame or series object.

With the argument **`how=`** you can indicate whether rows with at least one missing value or with all values missing are dropped:

* **`how='any'`** (default): if any value is missing, drop that row
* **`how='all'`**: if all values are missing, drop that row

In [ ]:
country_data_dropna = country_data.dropna()
country_data_dropna.info()

With `.isnull()` we can check that the rows with missing values in the `'capital'` columns were indeed removed:

In [ ]:
country_data[country_data['capital'].isnull()]

In [ ]:
country_data_dropna[country_data_dropna['capital'].isnull()]

### Exercise <span class="exercise">2.e</span>

Drop rows in `country_data` with missing values in the `'tld'` column. Assign the resulting data frame to `dropped_na_tld`.

Hint: look up the documentation of `dropna()` (e.g. via Shift-Tab-Tab)

In [ ]:
#// BEGIN_TODO [ORG_2e] Drop missing data (1 point)

# ===== =====> Replace this line by your code. <===== ===== #

#// END_TODO [ORG_2e]

dropped_na_tld.info()

## `df.fillna()` to replace missing values

With **`df.fillna()`** or **`ts.fillna()`**
you can replace *missing values* (_Not-Available_ (NA) and _Not-a-Number_ (NaN))
in a data frame or series object.

As always, note that this returns a new copy with the filled object.

In [ ]:
country_data_filled = country_data['capital'].fillna(value='Unknown')
country_data_filled[country_data_filled.duplicated(keep=False)]

You can replace missing values in particular columns by providing a dictionary for the first argument, specifying which value to use for which column.

In [ ]:
country_data_filled = country_data.fillna({'capital': 'Unknown'})
country_data_filled

### Exercise <span class="exercise">2.f</span>

Fill the missing values in the `'tld'` column of the `country_data` data frame with `'Missing'`.

Assign the resulting data frame to `filled_tld`.

In [ ]:
#// BEGIN_TODO [ORG_2f] Fill missing data (1 point)

# ===== =====> Replace this line by your code. <===== ===== #

#// END_TODO [ORG_2f]

filled_tld.info()

## `ts.str.strip()` to strip characters from begin/end of strings

With **`ts.str.strip()`** you can remove characters from the beginning and end of all strings in a `Series` object.

Without argument, it strips all leading and trailing **whitespace**.

Here we strip all trailing and leading zeros from the area that was converted to a string
in an earlier example.

In [ ]:
country_data_as_str['area'].str.strip('0')

### Exercise <span class="exercise">2.g</span>

Remove the character `'s'` from the beginning and end of all the country names in `country_data`. Assign the resulting series to `stripped_names`.

In [ ]:
#// BEGIN_TODO [ORG_2g] Strip the 's' (1 point)

# ===== =====> Replace this line by your code. <===== ===== #

#// END_TODO [ORG_2g]

stripped_names

# <span class="section">3.</span> Exercises: cleaning the mouse experiment


*In the earlier exercises you were closely guided. In the following exercises we will put your knowledge to the test.*

*Note that these exercises may seem more difficult as you will need to work more indepedently. When you struggle with an exercise then go back to the corresponding earlier section and make sure you really understand the introduced concepts. Do not hesitate to experiment with your own code!*


In the following exercises we will analyze the data from the mouse experiment that many of you have contributed to.

### Exercise <span class="exercise">3.a</span>

Read the data from `'datasets/paths_props.csv'` into a data frame and assign it `df_props`.

In [ ]:
#// BEGIN_TODO [ORG_3a] Read the data (1 point)

# ===== =====> Replace this line by your code. <===== ===== #

#// END_TODO [ORG_3a]

df_props.head()

Each row describes a single trial, i.e. one movement from the center to the target. The meaning of the columns is the following:

- `'user'`: The id of the user that recorded this trial.
- `'trial'`: The trial number. Trial numbers are local to each user.
- `'use_tue_laptop'`: 1 means a TU/e laptop was used during this trial, 0 means a different laptop was used
- `'mouse_speed'`, `'mouse_accuracy'`: 1 means the user confirmed this mouse setting, 0 or `NaN` means the user did not confirm this mouse setting. For example, for users who claim using a non-TU/e laptop, the `'mouse_speed'` and `'mouse_accuracy'` options are not shown and the user cannot fill those in.
- `'right_handed'`: 1 means user writes with their right hand, 0 means user writes with their left hand
- `'input_method'`: 0 means a trackpad, 1 means a mouse
- `'target_x'`, `'target_y'`: the screen coordinates in pixels of the blue target, relative to the red dot in the center
- `'target_radius'`: radius of the blue target in pixels
- `'delay'`: delay in seconds between the start of the trial (i.e. the moment that the mouse was placed on the red dot) and the moment that the blue target was shown
- `'major'`: the major of the user

As you can see, there is a lot of redundancy in the data. We will reorganize the data into two tables: one describing the user settings (which do not change), and one describing the individual trials. These two tables will be linked via the `'user'` column.

### Exercise <span class="exercise">3.b</span>

Inspect the `df_props` data frame. You will notice that the `'mouse_speed'` and `'mouse_accuracy'` columns contain NaN  values. They are the result of a user using a non-TU/e laptop and not having to confirm these mouse settings. Replace these values in `'mouse_speed'`, `'mouse_accuracy'` by 0.

In [ ]:
#// BEGIN_TODO [ORG_3b] Fill missing data (1 point)

# ===== =====> Replace this line by your code. <===== ===== #

#// END_TODO [ORG_3b]

df_props.info()

### Exercise <span class="exercise">3.c</span>

Convert the `'mouse_speed'`, `'mouse_accuracy'` columns to `int` type.

In [ ]:
#// BEGIN_TODO [ORG_3c] Convert to integers (1 point)

# ===== =====> Replace this line by your code. <===== ===== #

#// END_TODO [ORG_3c]

df_props.info()

### Exercise <span class="exercise">3.d</span>

Create a data frame `df_trials` from `df_props` with the columns `'user'`, `'trial'`, `'input_method'`, `'target_x'`, `'target_y'`, `'target_radius'`, `'delay'`.

In [ ]:
#// BEGIN_TODO [ORG_3d] Collect trials information (1 point)

# ===== =====> Replace this line by your code. <===== ===== #

#// END_TODO [ORG_3d]

df_trials.head()

### Exercise <span class="exercise">3.e</span>

Create a data frame `df_users` from `df_props` with the columns `'user'`, `'use_tue_laptop'`, `'mouse_speed'`, `'mouse_accuracy'`, `'right_handed'`, `'major'`, avoiding duplicate rows.

In [ ]:
#// BEGIN_TODO [ORG_3e] Collect users information (1 point)

# ===== =====> Replace this line by your code. <===== ===== #

#// END_TODO [ORG_3e]

df_users.head()

### Exercise <span class="exercise">3.f</span>

Inspect the `df_users` data frame. You will notice that for some users there is more than one row. For example, some users appear to have indicated multiple computer settings. Since at this point we cannot ask those users which settings they have actually used, we will discard those users and the corresponding trials.

Identify which users have entered contradicting information, i.e. both right and left handed or using different computer settings, and assign them to a list `wrong_users`.

Hint: for these users there will be multiple rows in the data frame.

In [ ]:
#// BEGIN_TODO [ORG_3f] Find the wrong users (1 point)

# ===== =====> Replace this line by your code. <===== ===== #

#// END_TODO [ORG_3f]

wrong_users

### Exercise <span class="exercise">3.g</span>

Discard the rows from `df_users` and `df_trials` corresponding to the users which have entered contradicting information.

Hint: use a `for` loop and remove the rows corresponding to those users one by one.

In [ ]:
#// BEGIN_TODO [ORG_3g] Discard the wrong users (1 point)

# ===== =====> Replace this line by your code. <===== ===== #

#// END_TODO [ORG_3g]

# <span class="section">4.</span> Exercises: analyzing the mouse experiment

In these exercises we will analyze the mouse experiment data to see if the experiment was properly conducted. We will use the data stored in the SQLite database in the 'datasets/mouse_experiment.db' file. This database contains two tables: 

- the **users** table, which contains columns `'user'`, `'use_tue_laptop'`, `'mouse_speed'`, `'mouse_accuracy'`, `'right_handed'`, `'major'`
- the **trials** table, which contains columns `'user'`, `'trial'`, `'input_method'`, `'target_x'`, `'target_y'`, `'target_radius'`, `'delay'`

These two tables are linked via the `'user'` column. The meaning of the other columns is in the `'datasets/paths_props.csv'` file described above.

### Exercise <span class="exercise">4.a</span>

Connect to the SQLite database `'datasets/mouse_experiment.db'`, assigning the connection to variable **`conn_experiment`**.

In [ ]:
#// BEGIN_TODO [ORG_4a] Connect to mouse experiment database (1 point)

# ===== =====> Replace this line by your code. <===== ===== #

#// END_TODO [ORG_4a]

### Exercise <span class="exercise">4.b</span>

Execute a query to count the number of trials that were performed by user 2 with a mouse.

Assign the query to variable `query_user_mouse`, and the result (an integer number) to variable `num_user_mouse`.

In [ ]:
#// BEGIN_TODO [ORG_4b] Count the trials (1 point)

# ===== =====> Replace this line by your code. <===== ===== #

#// END_TODO [ORG_4b]

num_user_mouse

### Exercise <span class="exercise">4.c</span>

Execute a query to count the number of trials that were performed with a trackpad.

Assign the query to variable `query_all_trackpad`, and the result (an integer number) to variable `num_all_trackpad`.

In [ ]:
#// BEGIN_TODO [ORG_4c] Count the trackpad trials (1 point)

# ===== =====> Replace this line by your code. <===== ===== #

#// END_TODO [ORG_4c]

num_all_trackpad

### Exercise <span class="exercise">4.d</span>

Execute a query to count the number of trials that were performed by left handed people.

Assign the query to variable `query_lefthanded`, and the result (an integer number) to variable `num_lefthanded`.

Hint: you will need to combine data from both `trials` and `users` tables.

In [ ]:
#// BEGIN_TODO [ORG_4d] Count the lefthanded trials (1 point)

# ===== =====> Replace this line by your code. <===== ===== #

#// END_TODO [ORG_4d]

num_lefthanded

### Exercise <span class="exercise">4.e</span>

Execute a query to compute the average delay between the start of a trial and the moment the target was shown for left handed vs. right handed people.

Assign the query to variable `query_delay`, and the result (a data frame with two rows, first row for left handed and second for right handed people, and one column `'average delay'`) to variable `result_delay`.

Hint: use the `GROUP BY` clause.

In [ ]:
#// BEGIN_TODO [ORG_4e] Average delay (1 point)

# ===== =====> Replace this line by your code. <===== ===== #

#// END_TODO [ORG_4e]

result_delay

### Exercise <span class="exercise">4.f</span>

Let us check whether the experiment was properly conducted. In particular, let us check whether the users working with a mouse were not disadvantaged compared to those using the trackpad. We will do it in two steps. First, execute a query to compute the average radius of targets that were shown to users using the different input methods.

Assign the query to variable `query_radius`, and the result (a data frame with two columns `'method'` and `'average radius'`) to variable `result_radius`.

Hint: use the `GROUP BY` clause to aggregate the different methods.

In [ ]:
#// BEGIN_TODO [ORG_4f] Average radius (1 point)

# ===== =====> Replace this line by your code. <===== ===== #

#// END_TODO [ORG_4f]

result_radius

### Exercise <span class="exercise">4.g</span>

We consider the experiment to be properly conducted if the average difference in target radius between the two input methods is at most 20% of the smaller value. Was the experiment properly conducted?

Assign your boolean answer to `proper_experiment`.

In [ ]:
#// BEGIN_TODO [ORG_4g] Proper experiment? (1 point)

# ===== =====> Replace this line by your code. <===== ===== #

#// END_TODO [ORG_4g]

proper_experiment

### Exercise <span class="exercise">4.h</span>

Close the connection to the `'mouse_experiment.db'` database.

In [ ]:
#// BEGIN_TODO [ORG_4h] Close the mouse experiment database (1 point)

# ===== =====> Replace this line by your code. <===== ===== #

#// END_TODO [ORG_4h]

# Feedback

Please fill in this questionaire to help us improve this course for the next year. Your feedback will be anonymized and will not affect your grade in any way!

### How many hours did you spend on these Exercises?

Assign a number to `feedback_time`.

In [ ]:
#// BEGIN_TODO [Feedback_1] (0 point)

# ===== =====> Replace this line by your code. <===== ===== #

#// END_TODO [Feedback_1] (0 point)

import numbers
assert isinstance(feedback_time, numbers.Number), "Please assign a number to feedback_time"
feedback_time

### How difficult did you find these Exercises?

Assign an integer to `feedback_difficulty`, on a scale 1 - 10, with 1 being very easy.

In [ ]:
#// BEGIN_TODO [Feedback_2] (0 point)

# ===== =====> Replace this line by your code. <===== ===== #

#// END_TODO [Feedback_2] (0 point)

import numbers
assert isinstance(feedback_difficulty, numbers.Number), "Please assign a number to feedback_difficulty"
feedback_difficulty

### (Optional) What did you like?

Assign a string to `feedback_like`.

In [ ]:
#// BEGIN_TODO [Feedback_3] (0 point)

# ===== =====> Replace this line by your code. <===== ===== #

#// END_TODO [Feedback_3] (0 point)

### (Optional) What can be improved?

Assign a string to `feedback_improve`.

In [ ]:
#// BEGIN_TODO [Feedback_4] (0 point)

# ===== =====> Replace this line by your code. <===== ===== #

#// END_TODO [Feedback_4] (0 point)




## How to submit your work

1. **Before submitting**, you must run your notebook by doing **Kernel > Restart & Run All**.  
   Make sure that your notebook runs without errors **in linear order**.

2. Remember to rename the notebook, replacing `...-template.ipynb` with `...-yourIDnr.ipynb`, where `yourIDnr` is your TU/e identification number.

3. Submit the executed notebook with your work
   for the appropriate assignment in **Canvas**.

* In the **Momotor** tab in Canvas,
  you can select that assignment again to find some feedback on your submitted work.
  
* If there are any problems reported by _Momotor_,
  then you need to fix those,
  and **resubmit the fixed notebook**.

In case of a high workload on our server
(because many students submit close to the deadline),
it may take longer to receive the feedback.

---

In [ ]:
# List all defined names
%whos

---

# (End of Notebook) 

&copy; 2017-2019 - **TU/e** - Eindhoven University of Technology